export const metadata = {
  title: "งานออกแบบกราฟิก | Muffy Design",
  description: "รับทำเว็บไซต์ ออกแบบเว็บไซต์ สร้างร้านค้าออนไลน์ของคุณ ระบบใช้งานง่าย หน้าตาดูทันสมัย ออกแบบครบวงจร เหมาะสำหรับทุกธุรกิจ ให้คำปรึกษาฟรี! โทร 094-303-0401",
  keywords: "รับทำเว็บไซต์,ออกแบบเว็บไซต์,สร้างเว็บไซต์,เว็บไซต์สำเร็จรูป,พัฒนาเว็บไซต์,ร้านค้าออนไลน์,เว็บแอปพลิเคชัน,พัฒนาเว็บไซต์มือถือ,WordPress,React,Next.js,รับทำเว็บไซต์ราคาถูก,ออกแบบเว็บไซต์สวยงาม,จ้างทำเว็บไซต์,เว็บไซต์ responsive,เว็บไซต์ one page,ปรึกษาฟรี,เว็บไซต์ e-commerce",
  og: {
    title: "งานออกแบบกราฟิก | Muffy Design",
    description: "รับทำเว็บไซต์ ออกแบบเว็บไซต์ สร้างร้านค้าออนไลน์ของคุณ ระบบใช้งานง่าย หน้าตาดูทันสมัย ออกแบบครบวงจร เหมาะสำหรับทุกธุรกิจ ให้คำปรึกษาฟรี! โทร 094-303-0401",
    image: "/images/og-image.jpg",
    url: "https://yourwebsite.com"
  },
  twitter: {
    card: "summary_large_image",
    title: "งานออกแบบกราฟิก | Muffy Design",
    description: "รับทำเว็บไซต์ ออกแบบเว็บไซต์ สร้างร้านค้าออนไลน์ของคุณ ระบบใช้งานง่าย หน้าตาดูทันสมัย ออกแบบครบวงจร เหมาะสำหรับทุกธุรกิจ ให้คำปรึกษาฟรี! โทร 094-303-0401",
    image: "https://yourwebsite.com/your-image.jpg"
  }
};

export default function Layout({ children }) {
  return <main>{children}</main>
}
