import { 
    g1, g2, g3, g4, g5, rubber5, logo2, card6, stk9, print20, 
    logo3, logo4, logo5, stk4,
    rubber1, rubber2, rubber4, rubber6,
    card1, card2, card3, card4,
    stk1, stk2, stk3, stk5, stk6,
    print3, print4, print5, print21
 } from '../../public/exportImg';

export const cardNews = [
    {
        id: 1,
        img: g1,
        title: 'Lorem Ipsum คืออะไร?',
        detail: 'Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์ มันได้กลายมาเป็นเนื้อหาจำลองมาตรฐานของธุรกิจดังกล่าวมาตั้งแต่ศตวรรษที่ 16 เมื่อเครื่องพิมพ์',
    },
    {
        id: 2,
        img: g2,
        title: 'ทำไมจึงต้องนำมาใช้?',
        detail: 'เนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง Lorem Ipsum อยู่ยงคงกระพันมาไม่ใช่แค่เพียงห้าศตวรรษ แต่อยู่มาจนถึง',
    },
    {
        id: 3,
        img: g3,
        title: 'มันมีที่มาอย่างไร?',
        detail: 'ยุคที่พลิกโฉมเข้าสู่งานเรียงพิมพ์ด้วยวิธีทางอิเล็กทรอนิกส์ และยังคงสภาพเดิมไว้อย่างไม่มีการเปลี่ยนแปลง มันได้รับความนิยมมากขึ้นในยุค ค.ศ. 1960 เมื่อแผ่น',
    },
    {
        id: 4,
        img: g4,
        title: 'จะนำมาใช้ได้จากที่ไหน?',
        detail: 'Letraset วางจำหน่ายโดยมีข้อความบนนั้นเป็น Lorem Ipsum และล่าสุดกว่านั้น คือเมื่อซอฟท์แวร์การทำสื่อสิ่งพิมพ์ (Desktop Publishing) อย่าง Aldus',
    },
]

export const boxColsIcons = [
    {
        id: 1,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="M7 9q-.825 0-1.412-.587T5 7t.588-1.412T7 5t1.413.588T9 7t-.587 1.413T7 9M5 22q-.425 0-.712-.288T4 21q-.825 0-1.412-.587T2 19v-6h3v-.75q0-.95.65-1.6t1.6-.65q.5 0 .925.2t.775.55l1.4 1.55q.2.2.388.375t.412.325H18V4.85q0-.35-.25-.6t-.6-.25q-.15 0-.288.063t-.262.187L15.35 5.5q.125.425.05.838t-.3.762l-2.75-2.8q.35-.225.75-.288t.8.088l1.25-1.25q.4-.4.913-.625T17.15 2q1.2 0 2.025.825T20 4.85V13h2v6q0 .825-.587 1.413T20 21q0 .425-.288.713T19 22zm-1-3h16v-4H4zm0 0h16z"/></svg>,
        title: 'ของแท้',
        detail: 'ของแทร่นาจาไอหนุ่ม',
    },
    {
        id: 2,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="M19 20H5v1a1 1 0 0 1-1 1H3a1 1 0 0 1-1-1V11l2.48-5.788A2 2 0 0 1 6.32 4h11.36a2 2 0 0 1 1.838 1.212L22 11v10a1 1 0 0 1-1 1h-1a1 1 0 0 1-1-1zm1-7H4v5h16zM4.176 11h15.648l-2.143-5H6.32zM6.5 17a1.5 1.5 0 1 1 0-3a1.5 1.5 0 0 1 0 3m11 0a1.5 1.5 0 1 1 0-3a1.5 1.5 0 0 1 0 3"/></svg>,
        title: 'ส่งด้วยใจ',
        detail: 'จัดส่งไว ทั่วไทย',
    },
    {
        id: 3,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="M11.5 20q-1.25 0-2.125-.875T8.5 17h2q0 .425.288.713T11.5 18t.713-.288T12.5 17t-.288-.712T11.5 16H2v-2h9.5q1.25 0 2.125.875T14.5 17t-.875 2.125T11.5 20M2 10V8h13.5q.65 0 1.075-.425T17 6.5t-.425-1.075T15.5 5t-1.075.425T14 6.5h-2q0-1.475 1.013-2.488T15.5 3t2.488 1.013T19 6.5t-1.012 2.488T15.5 10zm16.5 8v-2q.65 0 1.075-.425T20 14.5t-.425-1.075T18.5 13H2v-2h16.5q1.475 0 2.488 1.013T22 14.5t-1.012 2.488T18.5 18"/></svg>,
        title: 'ผ่อนได้ทุกชิ้น',
        detail: '0% จัดสเปคคอม',
    },
    {
        id: 4,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="m12.925 8.225l4.975-4.95q.275-.275.688-.288t.712.288q.275.275.275.7t-.275.7l-5.675 5.675q-.3.3-.7.3t-.7-.3L9.375 7.5q-.3-.3-.288-.7t.313-.7q.3-.275.7-.288t.7.288zM13.95 20.4l5.95-1.85q-.125-.225-.362-.388T19 18h-5.05q-.675 0-1.075-.05t-.825-.2l-1.425-.475q-.4-.125-.575-.5T10 16t.488-.588t.762-.062l1.05.35q.425.125.963.2t1.462.1H15q0-.275-.162-.525t-.388-.325L8.6 13H7v5.5zm-.525 1.95L7 20.55q-.2.65-.788 1.05T5 22H3q-.825 0-1.412-.587T1 20v-7q0-.825.588-1.412T3 11h5.6q.175 0 .35.038t.325.087L15.15 13.3q.825.3 1.338 1.05T17 16h2q1.25 0 2.125.825T22 19q0 .55-.288.863t-.887.512l-6.25 1.95q-.275.1-.575.1t-.575-.075M3 20h2v-7H3z"/></svg>,
        title: 'ผ่อนได้ทุกชิ้น',
        detail: '0% จัดสเปคคอม',
    },
    {
        id: 5,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="M17.5 16.5v2q0 .2.15.35T18 19t.35-.15t.15-.35v-2h2q.2 0 .35-.15T21 16t-.15-.35t-.35-.15h-2v-2q0-.2-.15-.35T18 13t-.35.15t-.15.35v2h-2q-.2 0-.35.15T15 16t.15.35t.35.15zM18 21q-2.075 0-3.537-1.463T13 16t1.463-3.537T18 11t3.538 1.463T23 16t-1.463 3.538T18 21M4 17V8q0-.475.213-.9t.587-.7l6-4.5q.275-.2.575-.3T12 1.5t.625.1t.575.3l6.05 4.55q.175.125.263.325t.087.425q0 .425-.288.713T18.6 8.2q-.175 0-.325-.05T18 8l-6-4.5L6 8v9h4q.425 0 .713.288T11 18t-.288.713T10 19H6q-.825 0-1.412-.587T4 17m8-6.75"/></svg>,
        title: 'ผ่อนได้ทุกชิ้น',
        detail: '0% จัดสเปคคอม',
    },
    {
        id: 6,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24"><path fill="#fff" d="m9.05 12.725l2.4-6.575l8.45 3.075q1.575.575 2.275 2.063t.125 3.062l-1.025 2.825zm3.6-4q-.2.5-.363.938t-.337.937l-.325.925zM1.45 13.15l.675-1.875l18.8 6.85L20.25 20zm4.875-1.6q-1.25 0-2.125-.875T3.325 8.55T4.2 6.425t2.125-.875t2.125.875t.875 2.125t-.875 2.125t-2.125.875m0-2q.425 0 .713-.288t.287-.712t-.288-.712t-.712-.288t-.712.288t-.288.712t.288.713t.712.287m5.3 1.975l8.45 3.1l.35-.95q.275-.8-.062-1.55T19.225 11.1L12.65 8.725zm-5.3-2.95"/></svg>,
        title: 'ผ่อนได้ทุกชิ้น',
        detail: '0% จัดสเปคคอม',
    },
]

export const webPackage = [
    {
        id: 1,
        img: g1,
        title: 'เริ่มต้น',
        subTitle: 'One Page สุดปัง',
        detail: 'detail',
        link: '#',
        period: '5',
        price: '3,000',
        for: 'ธุรกิจขนาดเล็ก, ผู้เริ่มต้นธุรกิจ, แคมเปญโปรโมทสินค้าหรือบริการเฉพาะ',
        skills: 'HTML, CSS, Tailwind CSS, JavaScript, Next.js',
        services: ['ออกแบบ Landing Page ที่สวยงามและตอบโจทย์ธุรกิจ', 'ออกแบบเว็บไซต์ 5 หน้า', 'ปรับขนาดให้เหมาะกับทุกอุปกรณ์', 'เชื่อมต่อ Social Media', 'เชื่อมต่อ Google Maps', 'SEO เบื้องต้น'],
        highlights: 'ออกแบบมาเพื่อสร้างความประทับใจแรกพบและกระตุ้นให้เกิดการกระทำ (Call to Action) เช่น การสมัครรับข่าวสาร หรือการซื้อสินค้า'
    },
    {
        id: 2,
        img: g2,
        title: 'มาตรฐาน',
        subTitle: 'เว็บไซต์บริหารข้อมูลครบจบ',
        detail: 'detail2',
        link: '#',
        period: '14',
        price: '6,000',
        for: 'ธุรกิจขนาดเล็กและกลาง, ผู้ต้องการนำเสนอข้อมูลสินค้าและบริการ',
        skills: 'HTML, CSS, Tailwind CSS, JavaScript, PHP, MySQL, WordPress (หรือระบบ CMS อื่นๆ)',
        services: ['ออกแบบ Landing Page ที่สวยงามและตอบโจทย์ธุรกิจ', 'ออกแบบเว็บไซต์ 10 หน้า', 'ปรับขนาดให้เหมาะกับทุกอุปกรณ์', 'เชื่อมต่อ Social Media', 'เชื่อมต่อ Google Maps', 'SEO เบื้องต้น', 'มีระบบสมัครสมาชิก', 'มีระบบหลังบ้าน', 'สามารถจัดการเนื้อหาหลังบ้าน', 'ระบบค้นหาข้อมูล'],
        highlights: 'เหมาะสำหรับธุรกิจที่ต้องการเว็บไซต์ที่สามารถจัดการเนื้อหาได้เอง และมีระบบฐานข้อมูลสำหรับเก็บข้อมูลพื้นฐาน'
    },
    {
        id: 3,
        img: g3,
        title: 'พรีเมียม',
        subTitle: 'เว็บไซต์ครบวงจร',
        detail: 'detail3',
        link: '#',
        period: '20',
        price: '10,000',
        for: 'ธุรกิจขนาดใหญ่, ผู้ต้องการระบบเว็บไซต์ที่ซับซ้อนและมีฟังก์ชันหลากหลาย',
        skills: 'HTML, CSS, Tailwind CSS, JavaScript, PHP, MySQL, Next.js, WordPress (หรือระบบ CMS อื่นๆ)',
        services: ['ออกแบบ Landing Page ที่สวยงามและระบบบริหารจัดการหลังบ้านที่มีความซับซ้อน', 'จำนวนหน้าขึ้นอยู่กับขนาดของระบบ', 'ปรับขนาดให้เหมาะกับทุกอุปกรณ์', 'เชื่อมต่อ Social Media', 'เชื่อมต่อ Google Maps', 'SEO ขั้นสูง', 'มีระบบสมัครสมาชิก', 'มีระบบหลังบ้าน', 'สามารถจัดการเนื้อหาหลังบ้าน', 'ระบบค้นหาข้อมูล', 'ระบบการชำระเงินผ่านธนาคาร', 'ตรวจสอบการชำระเงิน'],
        highlights: 'ตอบโจทย์ธุรกิจที่ต้องการระบบเว็บไซต์ที่สามารถเติบโตไปพร้อมกับธุรกิจ'

    },
]

// ออกแบบสื่อสิ่งพิมพ์, ออกแบบป้ายสแตนดี้ (Standee), ออกแบบป้ายโรลอัพ (Rollup), ออกแบบป้าย X Stand, ออกแบบป้ายธงญี่ปุ่น J Flag, ออกแบบโปสเตอร์, ออกแบบนามบัตร, ออกแบบตรายาง, ออกแบบ Sticker, ออกแบบป้าย Tag สินค้า, ออกแบบแผ่นพับ, ออกแบบการ์ดงานแต่ง, ออกแบบอื่นๆ

export const designProducts = [
    {
        id: 1,
        img: logo2,
        imgList: [logo2, logo3, logo4, logo5, stk4],
        title: 'ออกแบบ Logo',
        rating: 4,
        sold: 50,
        price: '900.00',
        detail: 'ก่อนเริ่มงานลูกค้าต้องเตรียมข้อมูลดังนี้',
        detailList: ['ชื่อแบรนด์', 'คำอธิบายสั้นๆ เกี่ยวกับธุรกิจ', 'logo สไตล์ที่ต้องการ', 'สีที่ชอบ โทนสีของโลโกที่ต้องการ', 'ตัวอย่างงานที่ชอบ แนวตัวอย่างงานที่ชอบ', 'ถ้ามีภาพร่างหรือสเกตช์สามารถแนบไฟล์ส่งมาได้เลยครับ'],
        additional: 'ขั้นตอนการทำงานทั้งหมด 1. ออกแบบให้เลือก 2 แบบ 2. ปรับแก้ไขได้ 3 รอบ 3. ส่งไฟล์งาน 4 ไฟล์ ai, png, pdf, jpg'
    },
    {
        id: 2,
        img: rubber5,
        imgList: [rubber5, rubber1, rubber2, rubber4, rubber6],
        title: 'ตรายาง',
        rating: 4,
        sold: 12,
        price: '300.00',
        detail: 'ก่อนเริ่มงานลูกค้าต้องเตรียมข้อมูลดังนี้',
        detailList: ['ชื่อแบรนด์', 'คำอธิบายสั้นๆ เกี่ยวกับธุรกิจ', 'logo สไตล์ที่ต้องการ', 'สีที่ชอบ โทนสีของโลโกที่ต้องการ', 'ตัวอย่างงานที่ชอบ แนวตัวอย่างงานที่ชอบ', 'ถ้ามีภาพร่างหรือสเกตช์สามารถแนบไฟล์ส่งมาได้เลยครับ'],
        additional: 'ทำไฟล์พร้อมผลิตและจัดส่งทั่วประเทศ ราคาเริ่มต้น 300 พร้อมทำไฟล์'
    },
    {
        id: 3,
        img: card6,
        imgList: [card6, card1, card2, card3, card4],
        title: 'นามบัตร',
        rating: 4,
        sold: 23,
        price: '250.00',
        detail: 'ก่อนเริ่มงานลูกค้าต้องเตรียมข้อมูลดังนี้',
        detailList: ['ชื่อแบรนด์', 'คำอธิบายสั้นๆ เกี่ยวกับธุรกิจ', 'logo สไตล์ที่ต้องการ', 'สีที่ชอบ โทนสีของโลโกที่ต้องการ', 'ตัวอย่างงานที่ชอบ แนวตัวอย่างงานที่ชอบ', 'ถ้ามีภาพร่างหรือสเกตช์สามารถแนบไฟล์ส่งมาได้เลยครับ'],
        additional: 'ขั้นตอนการทำงานทั้งหมด 1. ออกแบบให้เลือก 2 แบบ 2. ปรับแก้ไขได้ 3 รอบ 3. ส่งไฟล์งาน 4 ไฟล์ ai, png, pdf, jpg'
    },
    {
        id: 4,
        img: stk9,
        imgList: [stk9, stk1, stk2, stk3, stk6],
        title: 'สติ๊กเกอร์',
        rating: 4,
        sold: 10,
        price: '150.00',
        detail: 'ก่อนเริ่มงานลูกค้าต้องเตรียมข้อมูลดังนี้',
        detailList: ['ชื่อแบรนด์', 'คำอธิบายสั้นๆ เกี่ยวกับธุรกิจ', 'logo สไตล์ที่ต้องการ', 'สีที่ชอบ โทนสีของโลโกที่ต้องการ', 'ตัวอย่างงานที่ชอบ แนวตัวอย่างงานที่ชอบ', 'ถ้ามีภาพร่างหรือสเกตช์สามารถแนบไฟล์ส่งมาได้เลยครับ'],
        additional: 'ขั้นตอนการทำงานทั้งหมด 1. ออกแบบให้เลือก 2 แบบ 2. ปรับแก้ไขได้ 3 รอบ 3. ส่งไฟล์งาน 4 ไฟล์ ai, png, pdf, jpg'
    },
    {
        id: 5,
        img: print20,
        imgList: [print20, print3, print4, print5, print21],
        title: 'สื่อสิ่งพิมพ์',
        rating: 4,
        sold: 15,
        price: '150.00',
        detail: 'ก่อนเริ่มงานลูกค้าต้องเตรียมข้อมูลดังนี้',
        detailList: ['ชื่อแบรนด์', 'คำอธิบายสั้นๆ เกี่ยวกับธุรกิจ', 'logo สไตล์ที่ต้องการ', 'สีที่ชอบ โทนสีของโลโกที่ต้องการ', 'ตัวอย่างงานที่ชอบ แนวตัวอย่างงานที่ชอบ', 'ถ้ามีภาพร่างหรือสเกตช์สามารถแนบไฟล์ส่งมาได้เลยครับ'],
        additional: 'ขั้นตอนการทำงานทั้งหมด 1. ออกแบบให้เลือก 2 แบบ 2. ปรับแก้ไขได้ 3 รอบ 3. ส่งไฟล์งาน 4 ไฟล์ ai, png, pdf, jpg'
    },
]
